In [5]:
import pandas as pd

df = pd.DataFrame( { "groups": ["a","b","c","a","b","c"],
                     "var1" : [10,23,33,22,11,99],
                    "var2" : [100,200,300,200,423,457]},
                      columns= ["groups","var1","var2"]
                  )

In [6]:
df

  groups  var1  var2
0      a    10   100
1      b    23   200
2      c    33   300
3      a    22   200
4      b    11   423
5      c    99   457

In [9]:
def filterFunc(x):
    return x["var1"].std() > 10 # standart deviation > 10

In [10]:
df.groupby("groups").filter(filterFunc)

  groups  var1  var2
2      c    33   300
5      c    99   457

In [12]:
df.groupby("groups").std() > 10

         var1  var2
groups
a       False  True
b       False  True
c        True  True

In [13]:
df.groupby("groups").std()

             var1        var2
groups
a        8.485281   70.710678
b        8.485281  157.684812
c       46.669048  111.015765